# Loading Requried Libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

# Reading the Data

In [7]:
team_A=pd.read_excel('C:\\Users\\Vinu\\Downloads\\Voziq Hiring Challenge\\VPL.xlsx','Team A')
team_B=pd.read_excel('C:\\Users\\Vinu\\Downloads\\Voziq Hiring Challenge\\VPL.xlsx','Team B')

In [8]:
team_A.shape

(10, 2)

In [10]:
team_B.shape

(10, 2)

In [15]:
team_A.head()

     Batsman  Score
0    Upendra     15
1    Sandeep     12
2  Ravi Teja      1
3       Ravi      0
4    Pulliah      5

In [16]:
team_B.head()

   Batsman  Score
0   Vishwa     45
1     Vasu     54
2  Shravan      4
3   Satish     10
4      Sai     30

# Checking the Data type of the variables

In [19]:
print(type(team_A))
print(type(team_B))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

# Printing those individual batsman names and scores (in the order of highest scores to lowest) by Team

In [27]:
Sorted_A=team_A.sort_values(["Score"], axis=0, ascending=False)
Sorted_A

     Batsman  Score
5  Prabhakar     68
0    Upendra     15
1    Sandeep     12
4    Pulliah      5
7     Lokesh      5
8      Kiran      5
6   Mahendra      3
2  Ravi Teja      1
9      Durga      1
3       Ravi      0

In [24]:
Sorted_B=team_B.sort_values(["Score"], axis=0, ascending=False)
Sorted_B

   Batsman  Score
1     Vasu     54
0   Vishwa     45
4      Sai     30
8   Harish     26
6    Pavan     17
3   Satish     10
9     Guru      5
2  Shravan      4
5    Pavan      0
7   Naveen      0